{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ed817ecd-e106-486c-bcdb-20ecbab86a55",
   "metadata": {
    "tags": []
   },
   "source": [
    "# ToDo\n",
    "1. [x] Validate normalize ucum\n",
    "2. [x] Inverse normalize \n",
    "        'kg.m-1.s-2' -> 'kg/(m.s2)'\n",
    "3. [x] Validate inverse normalize\n",
    "4. [] Create Ucum-Mapping-Dictionary\n",
    "5. [] Nice-to-have: 'render' ucum\n",
    "        e. g. 'kg/(m s²) or '<math>\\frac{kg}{ms^2}</math>'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0b26d2c8-62ef-4ab3-8820-fb72d79bf1b6",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Function definitions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "6163c2f8-0d05-480f-a5a2-1f17766d9ec1",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, POST, BASIC, JSON\n",
    "import json\n",
    "\n",
    "def sparqlQuery(endpoint, query):\n",
    "    sparql = SPARQLWrapper(endpoint)\n",
    "    sparql.setMethod(POST)\n",
    "    #print(query)\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    #print(sparql.query())\n",
    "    return sparql.query().convert()\n",
    "\n",
    "def get_sparql_triplets(endpoint, where_statement, select_statement = \"\", inner_where_statement=\"?subject ?predicate ?object\", tsubject=\"\", tpredicate=\"\", tobject=\"\",limit=999999999):\n",
    "    select_statement = \"\"\n",
    "    if (tsubject == \"\"): select_statement += \" ?subject\"\n",
    "    if (tpredicate == \"\"): select_statement += \" ?predicate\"\n",
    "    if (tobject == \"\"): select_statement += \" ?object\"\n",
    "    if (tsubject != \"\"): inner_where_statement = inner_where_statement.replace(\"?subject\", \"<\" + tsubject + \">\")\n",
    "    if (tpredicate != \"\"): inner_where_statement = inner_where_statement.replace(\"?predicate\", \"<\" + tpredicate + \">\")\n",
    "    if (tobject != \"\"): inner_where_statement = inner_where_statement.replace(\"?object\", \"<\" + tobject + \">\")\n",
    "    query = \"\"\"\n",
    "        SELECT {{{select_statement}}}\n",
    "        WHERE {\n",
    "          {{{where_statement}}}\n",
    "            {  \n",
    "            SELECT {{{select_statement}}}\n",
    "            WHERE {\n",
    "                {{{inner_where_statement}}}\n",
    "            }\n",
    "          }\n",
    "        }\n",
    "        LIMIT {{{limit}}}\n",
    "    \"\"\".replace(\"{{{select_statement}}}\", select_statement).replace(\"{{{where_statement}}}\", where_statement).replace(\"{{{inner_where_statement}}}\", inner_where_statement).replace(\"{{{limit}}}\", str(limit))\n",
    "    print(query)\n",
    "    #select distinct ?p ?o where {<http://dbpedia.org/resource/Amount_of_substance> ?p ?o} LIMIT 100\n",
    "    triples = sparqlQuery(endpoint, query)\n",
    "    #print(triples)\n",
    "    tdict = {}\n",
    "    print(\"{} triplets found\".format(len(triples['results']['bindings'])))\n",
    "    for t in triples['results']['bindings']:\n",
    "        if (tsubject == \"\"): s = t['subject']['value']\n",
    "        else: s = tsubject\n",
    "        if (tpredicate == \"\"): p = t['predicate']['value']\n",
    "        else: p = tpredicate\n",
    "        if (tobject == \"\"): o = t['object']['value']\n",
    "        else: o = tobject\n",
    "        if 'xml:lang' in t['object']: o += \"@\" + t['object']['xml:lang']\n",
    "        #print(\"{} {} {}\".format(s,p,o))\n",
    "        dict_append_tripl(tdict, s, p, o)\n",
    "    #print(tdict)\n",
    "    return tdict\n",
    "\n",
    "def get_sparql_wikidata_statement_triplets(endpoint, where_statement ,limit=999999999):\n",
    "    select_statement = \"?subject ?predicate ?spredicate ?object\"\n",
    "    inner_where_statement=\"?subject ?predicate [?spredicate ?object; <http://wikiba.se/ontology#rank> ?rank]\"\n",
    "    query = \"\"\"\n",
    "        SELECT {{{select_statement}}}\n",
    "        WHERE {\n",
    "          {{{where_statement}}}\n",
    "            {  \n",
    "            SELECT {{{select_statement}}}\n",
    "            WHERE {\n",
    "                {{{inner_where_statement}}}\n",
    "            }\n",
    "          }\n",
    "        }\n",
    "        LIMIT {{{limit}}}\n",
    "    \"\"\".replace(\"{{{select_statement}}}\", select_statement).replace(\"{{{where_statement}}}\", where_statement).replace(\"{{{inner_where_statement}}}\", inner_where_statement).replace(\"{{{limit}}}\", str(limit))\n",
    "    print(query)\n",
    "    triples = sparqlQuery(endpoint, query)\n",
    "    #print(triples)\n",
    "    tdict = {}\n",
    "    print(\"{} triplets found\".format(len(triples['results']['bindings'])))\n",
    "    for t in triples['results']['bindings']:\n",
    "        \n",
    "        s = t['subject']['value']\n",
    "        p = t['predicate']['value']\n",
    "        sp = t['spredicate']['value']\n",
    "        o = t['object']['value']\n",
    "        if 'xml:lang' in t['object']: o += \"@\" + t['object']['xml:lang']\n",
    "        #print(\"{} {}/{} {}\".format(s,p,sp,o))\n",
    "        if (p.split('/')[-1] == sp.split('/')[-1]): dict_append_tripl(tdict, s, p, o) #e.g.  http://www.wikidata.org/prop/P2347 and http://www.wikidata.org/prop/statement/value-normalized/P2347\n",
    "    #print(tdict)\n",
    "    return tdict\n",
    "\n",
    "def qudtTypeQuery(qudt_type, limit=999999):\n",
    "    sparql = SPARQLWrapper(\"https://www.qudt.org/fuseki/qudt/sparql\")\n",
    "    sparql.setMethod(POST)\n",
    "\n",
    "    query = \"\"\"\n",
    "        PREFIX qudt: <http://qudt.org/schema/qudt/>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "\n",
    "        SELECT ?subject ?predicate ?object\n",
    "        WHERE {\n",
    "          ?subject rdf:type qudt:{{{qudt_type}}} .\n",
    "            {  \n",
    "            SELECT ?subject ?predicate ?object\n",
    "            WHERE {\n",
    "                ?subject ?predicate ?object \n",
    "            }\n",
    "          }\n",
    "        }\n",
    "        LIMIT {{{limit}}}\n",
    "    \"\"\".replace(\"{{{qudt_type}}}\",qudt_type).replace(\"{{{limit}}}\",str(limit))\n",
    "    #print(query)\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    #print(sparql.query())\n",
    "    return sparql.query().convert()\n",
    "\n",
    "def dict_append_tripl(d, s, p, o):\n",
    "    if not s in d: d[s] = {}\n",
    "    if not p in d[s]: d[s][p] = []\n",
    "    d[s][p].append(o)\n",
    "    \n",
    "def getQudtTypeDict(qudt_type, limit=999999):\n",
    "    triples = qudtTypeQuery(qudt_type, limit)\n",
    "    tdict = {}\n",
    "    for t in triples['results']['bindings']:\n",
    "        s = t['subject']['value']\n",
    "        p = t['predicate']['value']\n",
    "        o = t['object']['value']\n",
    "        if 'xml:lang' in t['object']: o += \"@\" + t['object']['xml:lang']\n",
    "        #print(\"{} {} {}\".format(s,p,o))\n",
    "        dict_append_tripl(tdict, s, p, o)\n",
    "    return tdict\n",
    "\n",
    "def print_subject_object(d, predicate_key):\n",
    "    for s in d:\n",
    "        print(\"{}: {}\".format(s, d[s].get(predicate_key, \"\")))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ec969978-b03c-42cf-a80c-99f52c0eb23f",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Get data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "03f9f17a-2c13-4718-8f7f-de1ec29e1112",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "913\n",
      "1773\n",
      "218\n",
      "\n",
      "        SELECT  ?subject ?predicate ?object\n",
      "        WHERE {\n",
      "          ?subject <http://www.wikidata.org/prop/direct/P279>*/<http://www.wikidata.org/prop/direct/P8393> ?qudtid.\n",
      "            {  \n",
      "            SELECT  ?subject ?predicate ?object\n",
      "            WHERE {\n",
      "                ?subject ?predicate ?object\n",
      "            }\n",
      "          }\n",
      "        }\n",
      "        LIMIT 999999999\n",
      "    \n",
      "213443 triplets found\n",
      "2921\n",
      "\n",
      "        SELECT ?subject ?predicate ?spredicate ?object\n",
      "        WHERE {\n",
      "          ?subject <http://www.wikidata.org/prop/direct/P279>*/<http://www.wikidata.org/prop/direct/P8393> ?qudtid.\n",
      "            {  \n",
      "            SELECT ?subject ?predicate ?spredicate ?object\n",
      "            WHERE {\n",
      "                ?subject ?predicate [?spredicate ?object; <http://wikiba.se/ontology#rank> ?rank]\n",
      "            }\n",
      "          }\n",
      "        }\n",
      "        LIMIT 999999999\n",
      "    \n",
      "143522 triplets found\n",
      "2921\n",
      "\n",
      "        SELECT  ?subject ?predicate ?object\n",
      "        WHERE {\n",
      "          ?subject <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q47574>.\n",
      "            {  \n",
      "            SELECT  ?subject ?predicate ?object\n",
      "            WHERE {\n",
      "                ?subject ?predicate ?object\n",
      "            }\n",
      "          }\n",
      "        }\n",
      "        LIMIT 999999999\n",
      "    \n",
      "45388 triplets found\n",
      "\n",
      "        SELECT  ?subject ?predicate ?object\n",
      "        WHERE {\n",
      "          ?subject <http://www.wikidata.org/prop/direct/P5061> ?symbol.\n",
      "            {  \n",
      "            SELECT  ?subject ?predicate ?object\n",
      "            WHERE {\n",
      "                ?subject ?predicate ?object\n",
      "            }\n",
      "          }\n",
      "        }\n",
      "        LIMIT 999999999\n",
      "    \n",
      "467318 triplets found\n",
      "\n",
      "        SELECT  ?subject ?predicate ?object\n",
      "        WHERE {\n",
      "          ?quantity <http://www.wikidata.org/prop/P8111>/<http://www.wikidata.org/prop/statement/P8111> ?subject.\n",
      "            {  \n",
      "            SELECT  ?subject ?predicate ?object\n",
      "            WHERE {\n",
      "                ?subject ?predicate ?object\n",
      "            }\n",
      "          }\n",
      "        }\n",
      "        LIMIT 999999999\n",
      "    \n",
      "379252 triplets found\n",
      "\n",
      "        SELECT  ?subject ?predicate ?object\n",
      "        WHERE {\n",
      "          ?subject <http://www.wikidata.org/prop/P111>/<http://www.wikidata.org/prop/statement/P111> ?quantity.\n",
      "            {  \n",
      "            SELECT  ?subject ?predicate ?object\n",
      "            WHERE {\n",
      "                ?subject ?predicate ?object\n",
      "            }\n",
      "          }\n",
      "        }\n",
      "        LIMIT 999999999\n",
      "    \n",
      "190035 triplets found\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "4166"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "limit = 999999999\n",
    "qdict = getQudtTypeDict('QuantityKind', limit)\n",
    "udict = getQudtTypeDict('Unit', limit)\n",
    "dSiDict = getQudtTypeDict('QuantityKindDimensionVector_SI', limit)\n",
    "dIsoDict = getQudtTypeDict('QuantityKindDimensionVector_ISO', limit)\n",
    "dImpDict = getQudtTypeDict('QuantityKindDimensionVector_Imperial', limit)\n",
    "dCgsDict = getQudtTypeDict('QuantityKindDimensionVector_CGS', limit)\n",
    "ddict = {**dImpDict, **dCgsDict, **dIsoDict, **dSiDict} #merge dicts\n",
    "#for q in qdict: print(q)\n",
    "#for u in udict: print(u)\n",
    "#for d in ddict: print(d)\n",
    "print(len(qdict))\n",
    "print(len(udict))\n",
    "print(len(ddict))\n",
    "\n",
    "#wdict1 = get_sparql_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P279>+ <http://www.wikidata.org/entity/Q107715>.\") #195656 triplets found\n",
    "#wdict2 = get_sparql_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P8393> ?qudtid.\") #48411 triplets found\n",
    "#wdict = {**wdict1, **wdict2} #merge dicts, 3966 results\n",
    "wdict = get_sparql_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P279>*/<http://www.wikidata.org/prop/direct/P8393> ?qudtid.\") #quantities with qudt ref and their subq, 2484 results\n",
    "print(len(wdict))\n",
    "#only subquantities\n",
    "#wdict = get_sparql_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P279>/<http://www.wikidata.org/prop/direct/P279>+ <http://www.wikidata.org/entity/Q107715>.\")\n",
    "#print(len(wdict))\n",
    "#wstdict1 = get_sparql_wikidata_statement_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P279>+ <http://www.wikidata.org/entity/Q107715>.\") #get statement object, 131347 triplets\n",
    "#wstdict2 = get_sparql_wikidata_statement_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P8393> ?qudtid.\") #get statement object, 37775 triplets\n",
    "#wstdict = {**wstdict1, **wstdict2} #merge dicts, 3966 results\n",
    "wstdict = get_sparql_wikidata_statement_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P279>*/<http://www.wikidata.org/prop/direct/P8393> ?qudtid.\") #get statement object\n",
    "print(len(wstdict))\n",
    "for st in wstdict:\n",
    "    for p in wstdict[st]:\n",
    "        o = wstdict[st][p]\n",
    "        wdict[st][p] = o #replace statement with object\n",
    "wudict1 = get_sparql_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q47574>.\") #instance of unit of measurement: 1340 results\n",
    "wudict2 = get_sparql_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/direct/P5061> ?symbol.\") #has unit symbol: 2230 results\n",
    "wudict3 = get_sparql_triplets(\"https://query.wikidata.org/sparql\", \"?quantity <http://www.wikidata.org/prop/P8111>/<http://www.wikidata.org/prop/statement/P8111> ?subject.\") #is recommended unit of measurement of: 294 results\n",
    "wudict4 = get_sparql_triplets(\"https://query.wikidata.org/sparql\", \"?subject <http://www.wikidata.org/prop/P111>/<http://www.wikidata.org/prop/statement/P111> ?quantity.\") #has measured quantity: 3278 results\n",
    "wudict = {**wudict1, **wudict2, **wudict3, **wudict4} #merge dicts, 3966 results\n",
    "len(wudict)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3fe2767a-f661-41cb-997f-18d705775e23",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Normalize ucum\n",
    "'kg/(m.s2)' -> 'kg.m-1.s-2'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "cb1bc92d-935e-4b76-90ba-0249fad23f5c",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "def normUcumFracToLin(ucum):\n",
    "    ucum = ucum.replace(\"[\",\"(\").replace(\"]\",\")\").replace(\"{\",\"(\").replace(\"}\",\")\")\n",
    "    result = \"\"\n",
    "    fraction = False\n",
    "    index = 0\n",
    "    for c in ucum: #iterate over all chars\n",
    "        skip = False\n",
    "        if c == '/': \n",
    "            fraction = True\n",
    "            if (index > 0): result += '.' #some ucums begin with a '/', no sep '.' needed\n",
    "            skip = True\n",
    "        if fraction:\n",
    "            if c == '.' and ucum[index-1] not in ['0','1','2','3','4','5','6','7','8','9']: #exponent 1 is implicit, e.g. 'm.' -> 'm1.' \n",
    "                result += '-1' #assume 1 and invert it to -1\n",
    "            if c == '(': \n",
    "                skip = True\n",
    "            elif c == ')': \n",
    "                skip = True\n",
    "                if index != len(ucum) - 1: \n",
    "                    print(\"Error: closing bracket not last char in {}\".format(ucum))\n",
    "                    return ucum\n",
    "            elif c == '-':\n",
    "                skip = True #make it positiv anyway\n",
    "                print(\"Warning: negativ exponent in fraction in {}\".format(ucum))\n",
    "            elif c in ['0','1','2','3','4','5','6','7','8','9']:\n",
    "                if ucum[index-1] in ['0','1','2','3','4','5','6','7','8','9']: #Todo: ignore factors like '/100cm2'\n",
    "                    print(\"Error: double number in {}\".format(ucum))\n",
    "                    return ucum\n",
    "                result += '-' #e.g. 's2' -> 's-2'\n",
    "            if not skip: result += c\n",
    "        else: result += c\n",
    "        if not fraction and (c == '(' or c == ')'): \n",
    "            print(\"Error: brackets without fraktion in {}\".format(ucum))\n",
    "            return ucum\n",
    "        index += 1\n",
    "    if fraction and result[-1] not in ['0','1','2','3','4','5','6','7','8','9']: \n",
    "        result += '-1' #e.g. '/m': exponent 1 is implicit -> '/m-1'\n",
    "    #if ucum != result: print(\"Normalize '{}' to '{}'\".format(ucum, result)) \n",
    "    return result\n",
    "#nomalize_ucum(\"kg/(m.s2)\") "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4ae30b79-6623-4d92-9145-73af0cb4f868",
   "metadata": {
    "tags": []
   },
   "source": [
    "## 1. Validate normalization ucum"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2aaf82a-def3-4c7a-8fb2-d802ea3ccb04",
   "metadata": {
    "tags": []
   },
   "source": [
    "### function definition: export dictionary as json object"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b15bf924-39e3-4555-b9c0-9518a1762ee0",
   "metadata": {},
   "outputs": [],
   "source": [
    "def dictToJson(dictionary, nameOfJson, optionalOrient=None, optionalPath=None):\n",
    "    import pandas as pd\n",
    "    from pathlib import Path\n",
    "    if optionalOrient is None:\n",
    "        dfJson = pd.DataFrame.from_dict(dictionary)\n",
    "    else:\n",
    "        dfJson = pd.DataFrame.from_dict(dictionary, orient=optionalOrient)\n",
    "    if optionalPath is None: \n",
    "        filepathJson = Path(f'./dataExport/{nameOfJson}.json') \n",
    "    else: \n",
    "        Path(optionalPath)    \n",
    "    filepathJson.parent.mkdir(parents=True, exist_ok=True)  \n",
    "    dfJson.to_json(filepathJson)  "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e92ba19c-138e-4a6c-b5bd-389469ebd43b",
   "metadata": {
    "tags": []
   },
   "source": [
    "### normalize 'kg/(m.s2)' -> 'kg.m-1.s-2'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "4f358444-3a2c-4d84-9961-f279fb09cc98",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: Conflict for u: http://qudt.org/vocab/unit/Da vs http://qudt.org/vocab/unit/AMU\n",
      "Warning: Conflict for t.m-3: http://qudt.org/vocab/unit/TON_Metric-PER-M3 vs http://qudt.org/vocab/unit/TONNE-PER-M3\n",
      "Warning: Conflict for G: http://qudt.org/vocab/unit/Gs vs http://qudt.org/vocab/unit/GAUSS\n",
      "Warning: Conflict for [oz_av].[gal_br]-1: http://qudt.org/vocab/unit/OZ-PER-GAL_UK vs http://qudt.org/vocab/unit/OZ-PER-GAL\n",
      "Warning: Conflict for d: http://qudt.org/vocab/unit/DAY_Sidereal vs http://qudt.org/vocab/unit/DAY\n",
      "Warning: Conflict for min: http://qudt.org/vocab/unit/MIN vs http://qudt.org/vocab/unit/MIN_Sidereal\n",
      "Warning: Conflict for u: http://qudt.org/vocab/unit/U vs http://qudt.org/vocab/unit/Da\n",
      "Warning: Conflict for {#}.h-1: http://qudt.org/vocab/unit/NUM-PER-HR vs http://qudt.org/vocab/unit/REV-PER-HR\n",
      "Warning: Conflict for [lb_av].[gal_br]-1: http://qudt.org/vocab/unit/LB-PER-GAL vs http://qudt.org/vocab/unit/LB-PER-GAL_UK\n",
      "Warning: Conflict for [ston_av].[cyd_i]-1: http://qudt.org/vocab/unit/TON_US-PER-YD3 vs http://qudt.org/vocab/unit/TON_SHORT-PER-YD3\n",
      "Warning: Conflict for [lton_av]: http://qudt.org/vocab/unit/TON_UK vs http://qudt.org/vocab/unit/TON_LONG\n",
      "Warning: Conflict for [lcwt_av]: http://qudt.org/vocab/unit/Hundredweight_UK vs http://qudt.org/vocab/unit/CWT_LONG\n",
      "Warning: Conflict for h: http://qudt.org/vocab/unit/HR_Sidereal vs http://qudt.org/vocab/unit/HR\n",
      "Warning: Conflict for t.har-1: http://qudt.org/vocab/unit/TON_Metric-PER-HA vs http://qudt.org/vocab/unit/TONNE-PER-HA\n",
      "Warning: Conflict for erg.g-1: http://qudt.org/vocab/unit/ERG-PER-GM vs http://qudt.org/vocab/unit/ERG-PER-G\n",
      "Warning: Conflict for [gal_br]: http://qudt.org/vocab/unit/GAL_IMP vs http://qudt.org/vocab/unit/GAL_UK\n",
      "Warning: Conflict for [e]: http://qudt.org/vocab/unit/E vs http://qudt.org/vocab/unit/ElementaryCharge\n",
      "Warning: Conflict for [ston_av].h-1: http://qudt.org/vocab/unit/TON_SHORT-PER-HR vs http://qudt.org/vocab/unit/TON_US-PER-HR\n",
      "Warning: Conflict for t.d-1: http://qudt.org/vocab/unit/TON_Metric-PER-DAY vs http://qudt.org/vocab/unit/TONNE-PER-DAY\n",
      "Warning: Conflict for [bbl_us]: http://qudt.org/vocab/unit/BBL_US vs http://qudt.org/vocab/unit/BBL\n",
      "Warning: Conflict for [scwt_av]: http://qudt.org/vocab/unit/CWT_SHORT vs http://qudt.org/vocab/unit/Hundredweight_US\n",
      "Warning: Conflict for {#}.s-1: http://qudt.org/vocab/unit/NUM-PER-SEC vs http://qudt.org/vocab/unit/REV-PER-SEC\n",
      "Warning: Conflict for [ston_av]: http://qudt.org/vocab/unit/TON_SHORT vs http://qudt.org/vocab/unit/TON_US\n",
      "Warning: Conflict for [cup_us]: http://qudt.org/vocab/unit/CUP_US vs http://qudt.org/vocab/unit/CUP\n",
      "Warning: Conflict for [pt_br]: http://qudt.org/vocab/unit/PINT_UK vs http://qudt.org/vocab/unit/PINT\n",
      "Warning: Conflict for t.min-1: http://qudt.org/vocab/unit/TONNE-PER-MIN vs http://qudt.org/vocab/unit/TON_Metric-PER-MIN\n",
      "Warning: Conflict for s-1: http://qudt.org/vocab/unit/PER-SEC vs http://qudt.org/vocab/unit/SAMPLE-PER-SEC\n",
      "Warning: Conflict for [lbf_av].[ft_i]-1: http://qudt.org/vocab/unit/LB_F-PER-FT vs http://qudt.org/vocab/unit/KiloLB_F-PER-FT\n",
      "Warning: Conflict for [Btu_IT].[ft_i]-2.h-1.[degF]-1: http://qudt.org/vocab/unit/BTU_TH-FT-PER-FT2-HR-DEG_F vs http://qudt.org/vocab/unit/BTU_IT-PER-FT2-HR-DEG_F\n",
      "Warning: Conflict for cal_th.g-1: http://qudt.org/vocab/unit/CAL_TH-PER-G vs http://qudt.org/vocab/unit/CAL_TH-PER-GM\n",
      "Warning: Conflict for kgf: http://qudt.org/vocab/unit/KiloGM_F vs http://qudt.org/vocab/unit/KiloP\n",
      "Warning: Conflict for ': http://qudt.org/vocab/unit/ARCMIN vs http://qudt.org/vocab/unit/MIN_Angle\n",
      "Warning: Conflict for t.s-1: http://qudt.org/vocab/unit/TONNE-PER-SEC vs http://qudt.org/vocab/unit/TON_Metric-PER-SEC\n",
      "Warning: Conflict for t: http://qudt.org/vocab/unit/TONNE vs http://qudt.org/vocab/unit/TON_Metric\n",
      "Warning: Conflict for t.h-1: http://qudt.org/vocab/unit/TON_Metric-PER-HR vs http://qudt.org/vocab/unit/TONNE-PER-HR\n",
      "Warning: Conflict for [pwt_tr]: http://qudt.org/vocab/unit/Pennyweight vs http://qudt.org/vocab/unit/DWT\n",
      "Warning: Conflict for Bi: http://qudt.org/vocab/unit/BIOT vs http://qudt.org/vocab/unit/A_Ab\n",
      "Warning: Conflict for nH: http://qudt.org/vocab/unit/H_Ab vs http://qudt.org/vocab/unit/NanoH\n",
      "1773\n",
      "1383\n",
      "Error: brackets without fraktion in (diop)\n",
      "Error: brackets without fraktion in (mesh_i)\n",
      "Error: brackets without fraktion in (IU)\n",
      "Error: brackets without fraktion in (iU)\n",
      "Error: brackets without fraktion in (IU)\n",
      "Error: brackets without fraktion in (IU)\n",
      "Error: brackets without fraktion in (iU)\n",
      "Error: brackets without fraktion in (iU)\n",
      "Error: brackets without fraktion in (car_Au)\n",
      "Error: brackets without fraktion in (car_Au)\n",
      "Error: brackets without fraktion in (MET)\n",
      "Error: brackets without fraktion in (mi_br)\n",
      "Error: brackets without fraktion in (HPF)\n",
      "Error: brackets without fraktion in (cft_i)/s\n",
      "Error: brackets without fraktion in (PFU)\n",
      "Error: brackets without fraktion in (PNU)\n",
      "Error: brackets without fraktion in (bdsk'U)\n",
      "Error: brackets without fraktion in (p'diop)\n",
      "Error: brackets without fraktion in (p'diop)\n",
      "Error: brackets without fraktion in (bbl_us)/d\n",
      "Error: brackets without fraktion in (pt_us)\n",
      "Error: brackets without fraktion in (bu_us)\n",
      "Error: brackets without fraktion in (dpt_us)\n",
      "Error: brackets without fraktion in (lcwt_av)\n",
      "Error: brackets without fraktion in (breaths)/min\n",
      "Error: brackets without fraktion in (gil_us)\n",
      "Error: brackets without fraktion in (qt_br)\n",
      "Error: brackets without fraktion in (qt_us)\n",
      "Error: brackets without fraktion in (dqt_us)\n",
      "Error: brackets without fraktion in (gil_br)\n",
      "Error: brackets without fraktion in (ppth)\n",
      "Error: brackets without fraktion in (bu_br)\n",
      "Error: brackets without fraktion in cal_(15)\n",
      "Error: brackets without fraktion in cal_(20)\n",
      "Error: brackets without fraktion in (Btu_IT)\n",
      "Error: brackets without fraktion in (pt_br)\n",
      "Error: brackets without fraktion in (Btu_39)\n",
      "Error: brackets without fraktion in (Btu_59)\n",
      "Error: brackets without fraktion in (Btu_60)\n",
      "Error: brackets without fraktion in (Btu_m)\n",
      "Error: brackets without fraktion in m(Hg)\n",
      "Error: brackets without fraktion in (nmi_i)\n",
      "Error: brackets without fraktion in (mil_i)\n",
      "Error: brackets without fraktion in (in_us)\n",
      "Error: brackets without fraktion in (fth_us)\n",
      "Error: brackets without fraktion in cm(Hg)\n",
      "Error: brackets without fraktion in (den)\n",
      "Error: brackets without fraktion in (fur_us)\n",
      "Error: brackets without fraktion in (acr_us)\n",
      "Error: brackets without fraktion in (twp)\n",
      "Error: brackets without fraktion in (mil_us)\n",
      "Error: brackets without fraktion in (dr_av)\n",
      "Error: brackets without fraktion in (in_br)\n",
      "Error: brackets without fraktion in (ft_br)\n",
      "Error: brackets without fraktion in (rd_br)\n",
      "Error: brackets without fraktion in (fth_br)\n",
      "Error: brackets without fraktion in (yd_br)\n",
      "Error: brackets without fraktion in (nmi_br)\n",
      "Error: brackets without fraktion in (rch_us)\n",
      "Error: brackets without fraktion in (ch_br)\n",
      "Error: brackets without fraktion in (e).cm\n",
      "Error: brackets without fraktion in (lb_ap)\n",
      "Error: brackets without fraktion in (beth'U)\n",
      "Error: brackets without fraktion in (todd'U)\n",
      "Error: brackets without fraktion in (dye'U)\n",
      "Error: brackets without fraktion in (smgy'U)\n",
      "Error: brackets without fraktion in (knk'U)\n",
      "Error: brackets without fraktion in (mclg'U)\n",
      "Error: brackets without fraktion in (ELU)\n",
      "Error: brackets without fraktion in (nmi_i)/h\n",
      "Error: brackets without fraktion in (EU)\n",
      "Error: brackets without fraktion in (LPF)\n",
      "Error: brackets without fraktion in (PRU)\n",
      "Error: brackets without fraktion in (wood'U)\n",
      "Error: brackets without fraktion in (USP'U)\n",
      "Error: brackets without fraktion in (cin_i)/(lb_av)\n",
      "Error: brackets without fraktion in (ft_i)/h\n",
      "Error: brackets without fraktion in (hnsf'U)\n",
      "Error: brackets without fraktion in (mi_i)/min\n",
      "Error: brackets without fraktion in (mi_i)/s\n",
      "Error: brackets without fraktion in (in_i)/a\n",
      "Error: brackets without fraktion in (in_i)/min\n",
      "Error: brackets without fraktion in (lb_av)/(ft_i)3\n",
      "Error: brackets without fraktion in (lb_av)/(cin_i)\n",
      "Error: brackets without fraktion in (lb_av)/(yd_i)3\n",
      "Error: brackets without fraktion in (oz_m)/(yd_i)2\n",
      "Error: brackets without fraktion in (oz_m)/(ft_i)2\n",
      "Error: brackets without fraktion in (yd_i)/s\n",
      "Error: brackets without fraktion in (lb_av)/(lb_av)\n",
      "Error: closing bracket not last char in cd/(ft_i)2\n",
      "Error: brackets without fraktion in (yd_i)/min\n",
      "Error: brackets without fraktion in (yd_i)/h\n",
      "Error: brackets without fraktion in (in_i)/s2\n",
      "Error: brackets without fraktion in (yd_i)/s2\n",
      "Error: double number in 1/(100.eV)\n",
      "Error: closing bracket not last char in 1/(in_i)2\n",
      "Error: brackets without fraktion in (cft_i)/(lb_av)\n",
      "Error: brackets without fraktion in (lb_av)/(yd_i)2\n",
      "Error: brackets without fraktion in (ft_i)2/s\n",
      "Error: brackets without fraktion in (in_i)2/s\n",
      "Error: brackets without fraktion in (ft_i)2/h\n",
      "Error: brackets without fraktion in (ston_av)\n",
      "Error: brackets without fraktion in (S)\n",
      "Error: brackets without fraktion in (lb_av)\n",
      "Error: brackets without fraktion in (kn_i)\n",
      "Error: brackets without fraktion in (smi_us)\n",
      "Error: brackets without fraktion in (car_m)\n",
      "Error: brackets without fraktion in (gr)\n",
      "Error: brackets without fraktion in (Ch)\n",
      "Error: brackets without fraktion in (stone_av)\n",
      "Error: brackets without fraktion in (syd_i)\n",
      "Error: brackets without fraktion in (lbf_av)\n",
      "Error: brackets without fraktion in m(H2O)\n",
      "Error: brackets without fraktion in (cft_i)\n",
      "Error: brackets without fraktion in (HP)\n",
      "Error: brackets without fraktion in (dr_ap)\n",
      "Error: brackets without fraktion in (g)\n",
      "Error: brackets without fraktion in mm(Hg)\n",
      "Error: brackets without fraktion in (scwt_av)\n",
      "Error: brackets without fraktion in (ft_i)\n",
      "Error: brackets without fraktion in (in_i)\n",
      "Error: brackets without fraktion in (tsp_m)\n",
      "Error: brackets without fraktion in (bbl_us)\n",
      "Error: brackets without fraktion in (tsp_us)\n",
      "Error: brackets without fraktion in (e)\n",
      "Error: brackets without fraktion in (oz_av)\n",
      "Error: brackets without fraktion in (ch_br)\n",
      "Error: brackets without fraktion in (Btu)\n",
      "Error: brackets without fraktion in (Btu_th)\n",
      "Error: brackets without fraktion in (psi)\n",
      "Error: brackets without fraktion in cm(H2O)\n",
      "Error: brackets without fraktion in (pwt_tr)\n",
      "Error: brackets without fraktion in (ppb)\n",
      "Error: brackets without fraktion in (pptr)\n",
      "Error: brackets without fraktion in (degR)\n",
      "Error: brackets without fraktion in (lb_tr)\n",
      "Error: brackets without fraktion in (rd_us)\n",
      "Error: brackets without fraktion in (degF)\n",
      "Error: brackets without fraktion in B(SPL)\n",
      "Error: brackets without fraktion in B(SPL)\n",
      "Error: brackets without fraktion in (pk_us)\n",
      "Error: brackets without fraktion in (ly)\n",
      "Error: brackets without fraktion in (c)\n",
      "Error: brackets without fraktion in (degF)\n",
      "Error: brackets without fraktion in (acr_br)\n",
      "Error: brackets without fraktion in (cft_i)/min\n",
      "Error: brackets without fraktion in (sft_i)\n",
      "Error: brackets without fraktion in (lton_av)\n",
      "Error: brackets without fraktion in (cin_i)\n",
      "Error: brackets without fraktion in (oz_tr)\n",
      "Error: brackets without fraktion in (in_i'H2O)\n",
      "Error: brackets without fraktion in (oz_ap)\n",
      "Error: brackets without fraktion in mm(H2O)\n",
      "Error: brackets without fraktion in (ppm)\n",
      "Error: brackets without fraktion in (gal_br)\n",
      "Error: brackets without fraktion in (Cal)\n",
      "Error: brackets without fraktion in (foz_us)\n",
      "Error: brackets without fraktion in (yd_i)\n",
      "Error: brackets without fraktion in (foz_br)\n",
      "Error: brackets without fraktion in (degRe)\n",
      "Error: brackets without fraktion in (pk_br)\n",
      "Error: brackets without fraktion in (sin_i)\n",
      "Error: brackets without fraktion in (cyd_i)\n",
      "Error: brackets without fraktion in (in_i'Hg)\n",
      "Error: brackets without fraktion in (ch_us)\n",
      "Error: brackets without fraktion in (cup_us)\n",
      "Error: brackets without fraktion in (beats)/min\n",
      "Error: brackets without fraktion in (beats)/min\n",
      "Error: brackets without fraktion in (mu_0)\n",
      "Error: brackets without fraktion in (h)\n",
      "Error: brackets without fraktion in (drp)\n",
      "Error: brackets without fraktion in (bf_i)\n",
      "Error: brackets without fraktion in (didot)\n",
      "Error: brackets without fraktion in (m_e)\n",
      "Error: brackets without fraktion in (mi_us)\n",
      "Error: brackets without fraktion in (pnt_pr)\n",
      "Error: brackets without fraktion in (lne)\n",
      "Error: brackets without fraktion in (foz_m)\n",
      "Error: brackets without fraktion in (pnt)\n",
      "Error: brackets without fraktion in (gal_us)\n",
      "Error: brackets without fraktion in (sc_ap)\n",
      "Error: brackets without fraktion in (ft_us)\n",
      "Error: brackets without fraktion in (yd_us)\n",
      "Error: brackets without fraktion in (lk_us)\n",
      "Error: brackets without fraktion in (pied)\n",
      "Error: brackets without fraktion in (min_br)\n",
      "Error: brackets without fraktion in (fdr_br)\n",
      "Error: brackets without fraktion in (tbs_us)\n",
      "Error: brackets without fraktion in (tbs_m)\n",
      "Error: brackets without fraktion in (cup_m)\n",
      "Error: brackets without fraktion in (srd_us)\n",
      "Error: brackets without fraktion in (kn_br)\n",
      "Error: brackets without fraktion in (crd_us)\n",
      "Error: brackets without fraktion in (cr_i)\n",
      "Error: brackets without fraktion in (hd_i)\n",
      "Error: brackets without fraktion in (lk_br)\n",
      "Error: brackets without fraktion in (smoot)\n",
      "Error: brackets without fraktion in (ligne)\n",
      "Error: brackets without fraktion in (pca)\n",
      "Error: brackets without fraktion in (pouce)\n",
      "Error: brackets without fraktion in (mi_i)\n",
      "Error: brackets without fraktion in (fth_i)\n",
      "Error: brackets without fraktion in (min_us)\n",
      "Error: brackets without fraktion in (m_p)\n",
      "Error: brackets without fraktion in (k)\n",
      "Error: brackets without fraktion in (cicero)\n",
      "Error: brackets without fraktion in (cml_i)\n",
      "Error: brackets without fraktion in (oz_m)\n",
      "Error: brackets without fraktion in (pca_pr)\n",
      "Error: brackets without fraktion in (gal_wi)\n",
      "Error: brackets without fraktion in (fdr_us)\n",
      "Error: brackets without fraktion in (pc_br)\n",
      "Error: brackets without fraktion in (rlk_us)\n",
      "Error: brackets without fraktion in (eps_0)\n",
      "4166\n",
      "1704\n"
     ]
    }
   ],
   "source": [
    "ucum_u_dict = {} #ucum to qudt unit\n",
    "for u in udict:\n",
    "    if 'http://qudt.org/schema/qudt/ucumCode' in udict[u]: \n",
    "        if udict[u]['http://qudt.org/schema/qudt/ucumCode'][0] in ucum_u_dict:\n",
    "            e = udict[u]['http://qudt.org/schema/qudt/ucumCode'][0]\n",
    "            print(\"Warning: Conflict for {}: {} vs {}\".format(e, u, ucum_u_dict[e]))\n",
    "        ucum_u_dict[udict[u]['http://qudt.org/schema/qudt/ucumCode'][0]] = u\n",
    "print(len(udict))\n",
    "print(len(ucum_u_dict))\n",
    "#uwudict = {} # qudt unit to wiki data unit\n",
    "ucum_wu_dict = {} #ucum to wikidata unit\n",
    "for wu in wudict:\n",
    "    if 'http://www.wikidata.org/prop/direct/P7825' in wudict[wu]:# and 'http://www.wikidata.org/prop/direct/P5061' in wudict[wu]:\n",
    "        #print(wudict[wu]['http://www.wikidata.org/prop/direct/P5061'])\n",
    "        for e in wudict[wu]['http://www.wikidata.org/prop/direct/P7825']:\n",
    "            ucum_wu_dict[normUcumFracToLin(e)] = wu\n",
    "print(len(wudict))\n",
    "print(len(ucum_wu_dict))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cdd866f3-411e-4bc0-b547-04c6c47f5e2b",
   "metadata": {
    "tags": []
   },
   "source": [
    "#### create json objects of dictionaries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "64f3b34f-b7c1-425a-8237-cc3de098d84e",
   "metadata": {},
   "outputs": [],
   "source": [
    "dictToJson(udict, 'u_dict_qudt')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "241ef892-eb2e-4134-a25d-82ec78afd380",
   "metadata": {},
   "outputs": [],
   "source": [
    "dictToJson(ucum_u_dict, 'ucum_u_dict_qudt', 'index')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "6cbd6aa5-8278-4ef9-95cf-dc6fdf617fe1",
   "metadata": {},
   "outputs": [],
   "source": [
    "dictToJson(wudict, 'wudict_wikidata')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "c140086a-5294-4b14-a5d7-956fdb635fc8",
   "metadata": {},
   "outputs": [],
   "source": [
    "dictToJson(ucum_wu_dict, 'ucum_wu_dict_wikidata', 'index')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "398fcda8-f282-44d2-b7ef-50d7dcdd64fd",
   "metadata": {
    "tags": []
   },
   "source": [
    "### function definition: compare string elements of a unit by specific separator\n",
    "    a = \"erg.cm-2.s-1\"\n",
    "    b = \"erg.s-1.cm-2\" \n",
    "    c = \"erg.s-1.cm-8\" \n",
    "    separator = \".\"\n",
    "    \n",
    "    compareUnitElements(a, b, separator, maxsplit=None)\n",
    "    --> True\n",
    "    compareUnitElements(a, c, separator)\n",
    "    --> False"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "db990981-175b-4277-8a2a-c0577158a61d",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "def compareUnitElements(a, b, separator, maxsplit=None):\n",
    "    if maxsplit == None:\n",
    "        maxsplit = -1 # -1 equals all elements in split() defined by seperator\n",
    "    return( sorted(a.split(separator, maxsplit)) == sorted(b.split(separator, maxsplit)) ) "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ac735fd-77d2-4849-a6ce-bcb29a5895fb",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Validation method"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f2d906cf-e504-41c5-b01a-f4587d356c17",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Error: brackets without fraktion in (diop)\n",
      "Error: brackets without fraktion in (diop)\n",
      "Error: brackets without fraktion in (mesh_i)\n",
      "Error: brackets without fraktion in (mesh_i)\n",
      "Error: brackets without fraktion in (IU)\n",
      "Error: brackets without fraktion in (IU)\n",
      "Error: brackets without fraktion in (cft_i)/s\n",
      "Error: brackets without fraktion in (cft_i).s-1\n",
      "Error: brackets without fraktion in (bbl_us)/d\n",
      "Error: brackets without fraktion in (bbl_us)/d\n",
      "Error: brackets without fraktion in (pt_us)\n",
      "Error: brackets without fraktion in (pt_us)\n",
      "Error: brackets without fraktion in (bu_us)\n",
      "Error: brackets without fraktion in (bu_us)\n",
      "Error: brackets without fraktion in (dpt_us)\n",
      "Error: brackets without fraktion in (dpt_us)\n",
      "erg.cm-2.s-1 <-> erg.s-1.cm-2 is just unsorted\n",
      "Error: brackets without fraktion in (lcwt_av)\n",
      "Error: brackets without fraktion in (lcwt_av)\n",
      "Error: brackets without fraktion in (breaths)/min\n",
      "s-1.m-2.sr-1 <-> m-2.s-1.sr-1 is just unsorted\n",
      "Error: brackets without fraktion in kg.(s.m2)-1\n",
      "m.K.W-1 <-> K.m.W-1 is just unsorted\n",
      "Error: brackets without fraktion in m3.(kg.s2)-1\n",
      "Error: brackets without fraktion in (gil_us)\n",
      "Error: brackets without fraktion in (gil_us)\n",
      "Error: brackets without fraktion in (qt_br)\n",
      "Error: brackets without fraktion in (qt_br)\n",
      "Error: brackets without fraktion in (qt_us)\n",
      "Error: brackets without fraktion in (qt_us)\n",
      "Error: brackets without fraktion in (dqt_us)\n",
      "Error: brackets without fraktion in (dqt_us)\n",
      "Error: brackets without fraktion in (gil_br)\n",
      "Error: brackets without fraktion in (gil_br)\n",
      "Error: brackets without fraktion in (ppth)\n",
      "Error: brackets without fraktion in (ppth)\n",
      "Error: brackets without fraktion in (bu_br)\n",
      "Error: brackets without fraktion in (bu_br)\n",
      "Error: brackets without fraktion in cal_(15)\n",
      "Error: brackets without fraktion in cal_(15)\n",
      "Error: brackets without fraktion in (Btu_IT)\n",
      "Error: brackets without fraktion in (Btu_IT)\n",
      "Error: brackets without fraktion in (pt_br)\n",
      "Error: brackets without fraktion in (pt_br)\n",
      "Error: brackets without fraktion in (Btu_m)\n",
      "Error: brackets without fraktion in (Btu_m)\n",
      "Error: brackets without fraktion in (mil_i)\n",
      "Error: brackets without fraktion in (mil_i)\n",
      "Error: brackets without fraktion in cm(Hg)\n",
      "Error: brackets without fraktion in cm(Hg)\n",
      "Error: brackets without fraktion in (den)\n",
      "Error: brackets without fraktion in (den)\n",
      "Error: brackets without fraktion in (nmi_i)/h\n",
      "Error: brackets without fraktion in (nmi_i)/h\n",
      "Error: brackets without fraktion in (ft_i)/h\n",
      "Error: brackets without fraktion in (ft_i).h-1\n",
      "Error: brackets without fraktion in (mi_i)/min\n",
      "Error: brackets without fraktion in (mi_i).min-1\n",
      "Error: brackets without fraktion in (lb_av)/(ft_i)3\n",
      "Error: brackets without fraktion in (lb_av).(cft_i)-1\n",
      "Error: brackets without fraktion in (lb_av)/(cin_i)\n",
      "Error: brackets without fraktion in (lb_av).(cin_i)-1\n",
      "Error: brackets without fraktion in (lb_av)/(yd_i)3\n",
      "Error: brackets without fraktion in (lb_av).(cyd_i)-1\n",
      "Error: brackets without fraktion in (in_i)/s2\n",
      "Error: brackets without fraktion in (in_i)/s2\n",
      "Error: brackets without fraktion in (ft_i)2/s\n",
      "Error: brackets without fraktion in (sft_i).s-1\n",
      "Error: brackets without fraktion in (in_i)2/s\n",
      "Error: brackets without fraktion in (sin_i).s-1\n",
      "Error: brackets without fraktion in (ft_i)2/h\n",
      "Error: brackets without fraktion in (sft_i).h-1\n",
      "Error: brackets without fraktion in (ston_av)\n",
      "Error: brackets without fraktion in (ston_av)\n",
      "Error: brackets without fraktion in (lb_av)\n",
      "Error: brackets without fraktion in (lb_av)\n",
      "Error: brackets without fraktion in (kn_i)\n",
      "Error: brackets without fraktion in (kn_i)\n",
      "Error: brackets without fraktion in (smi_us)\n",
      "Error: brackets without fraktion in (mi_us)2\n",
      "Error: brackets without fraktion in (car_m)\n",
      "Error: brackets without fraktion in (car_m)\n",
      "Error: brackets without fraktion in (gr)\n",
      "Error: brackets without fraktion in (gr)\n",
      "Error: brackets without fraktion in (Ch)\n",
      "Error: brackets without fraktion in (Ch)\n",
      "Error: brackets without fraktion in (stone_av)\n",
      "Error: brackets without fraktion in (stone_av)\n",
      "Error: brackets without fraktion in (syd_i)\n",
      "Error: brackets without fraktion in (yd_i)2\n",
      "Error: brackets without fraktion in (lbf_av)\n",
      "Error: brackets without fraktion in (lbf_av)\n",
      "Error: brackets without fraktion in (cft_i)\n",
      "Error: brackets without fraktion in (ft_i)3\n",
      "Error: brackets without fraktion in (HP)\n",
      "Error: brackets without fraktion in (HP)\n",
      "Error: brackets without fraktion in (g)\n",
      "Error: brackets without fraktion in (g)\n",
      "Error: brackets without fraktion in mm(Hg)\n",
      "Error: brackets without fraktion in mm(Hg)\n",
      "Error: brackets without fraktion in (scwt_av)\n",
      "Error: brackets without fraktion in (scwt_av)\n",
      "Error: brackets without fraktion in (tsp_m)\n",
      "Error: brackets without fraktion in (tsp_us)\n",
      "Error: brackets without fraktion in (bbl_us)\n",
      "Error: brackets without fraktion in (bbl_us)\n",
      "Error: brackets without fraktion in (e)\n",
      "Error: brackets without fraktion in (e)\n",
      "Error: brackets without fraktion in (oz_av)\n",
      "Error: brackets without fraktion in (oz_av)\n",
      "Error: brackets without fraktion in (ch_br)\n",
      "Error: brackets without fraktion in (ch_br)\n",
      "Error: brackets without fraktion in (Btu)\n",
      "Error: brackets without fraktion in (Btu_th)\n",
      "Error: brackets without fraktion in (psi)\n",
      "Error: brackets without fraktion in (lbf_av).(sin_i)-1\n",
      "Error: brackets without fraktion in cm(H2O)\n",
      "Error: brackets without fraktion in (pwt_tr)\n",
      "Error: brackets without fraktion in (pwt_tr)\n",
      "Error: brackets without fraktion in (ppb)\n",
      "Error: brackets without fraktion in (ppb)\n",
      "Error: brackets without fraktion in (pptr)\n",
      "Error: brackets without fraktion in (pptr)\n",
      "Error: brackets without fraktion in (degR)\n",
      "Error: brackets without fraktion in (degR)\n",
      "Error: brackets without fraktion in (lb_tr)\n",
      "Error: brackets without fraktion in (lb_tr)\n",
      "Error: brackets without fraktion in (rd_us)\n",
      "Error: brackets without fraktion in (rd_br)\n",
      "Error: brackets without fraktion in (pk_us)\n",
      "Error: brackets without fraktion in (pk_us)\n",
      "Error: brackets without fraktion in (ly)\n",
      "Error: brackets without fraktion in (ly)\n",
      "Error: brackets without fraktion in (degF)\n",
      "Error: brackets without fraktion in (degF)\n",
      "Error: brackets without fraktion in (acr_br)\n",
      "Error: brackets without fraktion in (acr_br)\n",
      "Error: brackets without fraktion in (cft_i)/min\n",
      "Error: brackets without fraktion in (ft_i)3/min\n",
      "Error: brackets without fraktion in (sft_i)\n",
      "Error: brackets without fraktion in (sft_i)\n",
      "Error: brackets without fraktion in (lton_av)\n",
      "Error: brackets without fraktion in (lton_av)\n",
      "Error: brackets without fraktion in (cin_i)\n",
      "Error: brackets without fraktion in (in_i)3\n",
      "Error: brackets without fraktion in (oz_tr)\n",
      "Error: brackets without fraktion in (oz_tr)\n",
      "Error: brackets without fraktion in (in_i'H2O)\n",
      "Error: brackets without fraktion in (in_i'H2O)\n",
      "Error: brackets without fraktion in mm(H2O)\n",
      "Error: brackets without fraktion in mm(H2O)\n",
      "Error: brackets without fraktion in (ppm)\n",
      "Error: brackets without fraktion in (ppm)\n",
      "Error: brackets without fraktion in (gal_br)\n",
      "Error: brackets without fraktion in (gal_br)\n",
      "Error: brackets without fraktion in (foz_us)\n",
      "Error: brackets without fraktion in (foz_us)\n",
      "Error: brackets without fraktion in (foz_br)\n",
      "Error: brackets without fraktion in (foz_br)\n",
      "Error: brackets without fraktion in (pk_br)\n",
      "Error: brackets without fraktion in (pk_br)\n",
      "Error: brackets without fraktion in (sin_i)\n",
      "Error: brackets without fraktion in (sin_i)\n",
      "Error: brackets without fraktion in (cyd_i)\n",
      "Error: brackets without fraktion in (cyd_i)\n",
      "Error: brackets without fraktion in (in_i'Hg)\n",
      "Error: brackets without fraktion in (in_i'Hg)\n",
      "Error: brackets without fraktion in (cup_us)\n",
      "Error: brackets without fraktion in (cup_us)\n",
      "Error: brackets without fraktion in (bf_i)\n",
      "Error: brackets without fraktion in (bf_i)\n",
      "Error: brackets without fraktion in (mi_us)\n",
      "Error: brackets without fraktion in (mi_us)\n",
      "Error: brackets without fraktion in (pnt)\n",
      "Error: brackets without fraktion in (pnt)\n",
      "Error: brackets without fraktion in (ft_us)\n",
      "Error: brackets without fraktion in (ft_us)\n",
      "Error: brackets without fraktion in (tbs_us)\n",
      "Error: brackets without fraktion in (tbs_us)\n",
      "Error: brackets without fraktion in (crd_us)\n",
      "Error: brackets without fraktion in (crd_us)\n",
      "Error: brackets without fraktion in (pca)\n",
      "Error: brackets without fraktion in (pca)\n",
      "Error: brackets without fraktion in (cml_i)\n",
      "Error: brackets without fraktion in (cml_i)\n",
      "242\n",
      "205\n",
      "34\n",
      "just unsorted counter:  3\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "regex = r\"(?<!\\d|-)1(?!\\d|/)\" #for positive exponents\n",
    "\n",
    "dataCleaningDict = {\n",
    "    \"frac\": {},\n",
    "    \"exp\": {}\n",
    "}\n",
    "\n",
    "diff_ucum_wucum = {}\n",
    "diff_ucum_wucumNorm = {}\n",
    "diff_ucumNorm_wucumNorm = {}\n",
    "unsorted = {}\n",
    "counter = 0\n",
    "for wu in wudict:\n",
    "    if 'http://www.wikidata.org/prop/direct/P2968' in wudict[wu] and 'http://www.wikidata.org/prop/direct/P7825' in wudict[wu]: #qudt and ucum defined \n",
    "        u = wudict[wu]['http://www.wikidata.org/prop/direct-normalized/P2968'][0] #qudt unit\n",
    "        w_ucum = wudict[wu]['http://www.wikidata.org/prop/direct/P7825'][0] # wikidate ucum\n",
    "        \n",
    "        w_ucum_norm = re.sub(regex, \"\", normUcumFracToLin(wudict[wu]['http://www.wikidata.org/prop/direct/P7825'][0]) ).replace(\"L\",\"l\")# wikidate ucum normalized\n",
    "        \n",
    "        if u in udict and 'http://qudt.org/schema/qudt/ucumCode' in udict[u]: #ucum defined \n",
    "            e = udict[u]['http://qudt.org/schema/qudt/ucumCode'][0]\n",
    "            \n",
    "            ucum_norm = re.sub(regex, \"\", normUcumFracToLin(udict[u]['http://qudt.org/schema/qudt/ucumCode'][0]) ).replace(\"L\",\"l\") # ucum defined & normalized\n",
    "            \n",
    "            if e != w_ucum:\n",
    "                diff_ucum_wucum[u] = f\"{e} <-> {w_ucum} DIFF FOR {u} <-> {wu}\"\n",
    "            if e != w_ucum_norm:\n",
    "                diff_ucum_wucumNorm[u] = f\"{e} <-> {w_ucum_norm} DIFF FOR {u} <-> NORM {wu}\"\n",
    "            if ucum_norm != w_ucum_norm:\n",
    "                if compareUnitElements(ucum_norm, w_ucum_norm, \".\"):\n",
    "                    print(f\"{ucum_norm} <-> {w_ucum_norm} is just unsorted\")\n",
    "                    counter+=1\n",
    "                    #diff_ucumNorm_wucumNorm[u] = f\"{ucum_norm} <-> {w_ucum_norm} DIFF FOR NORM {u} <-> NORM {wu}\"\n",
    "                    unsorted[u] = f\"{ucum_norm} <-> {w_ucum_norm} DIFF FOR NORM {u} <-> NORM {wu}\"\n",
    "                else:\n",
    "                    diff_ucumNorm_wucumNorm[u] = f\"{ucum_norm} <-> {w_ucum_norm} DIFF FOR NORM {u} <-> NORM {wu}\"\n",
    "                    dataCleaningDict[\"exp\"][ucum_norm] = w_ucum_norm\n",
    "\n",
    "                \n",
    "dictToJson(diff_ucum_wucum, '10diff_ucum_wucum', 'index')\n",
    "print(len(diff_ucum_wucum))\n",
    "dictToJson(diff_ucum_wucumNorm, '20diff_ucum_wucumNorm', 'index')\n",
    "print(len(diff_ucum_wucumNorm))\n",
    "dictToJson(diff_ucumNorm_wucumNorm, '30diff_ucumNorm_wucumNorm', 'index')\n",
    "print(len(diff_ucumNorm_wucumNorm))\n",
    "print(\"just unsorted counter: \", counter)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3c61f497-0291-4e20-a506-4a39a5342de7",
   "metadata": {
    "tags": []
   },
   "source": [
    "## 2. Inverse normalize \n",
    "'kg.m-1.s-2' -> 'kg/(m.s2)'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "94d8b1be-71f5-45ab-b0cd-20ad87e88ded",
   "metadata": {
    "tags": []
   },
   "source": [
    "### (sub-)function definition: splitString(string, separator, debug=None)\n",
    "    splits bracket sensitve string in single element array by using specific separator\n",
    "    --> limitations: \"()\" round brackets\n",
    "    --> objective: factorize any equation or unit\n",
    "    --> detection of multiple bracket elements and bracket elements with/without factors inside\n",
    "fixed issues: \n",
    "1. nested brackets with dots\n",
    "2. bracket input without dot\n",
    "3. more dot's inside pair of brackets"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "a8fae7f2-0971-4ed1-954d-2ce3990f3250",
   "metadata": {},
   "outputs": [],
   "source": [
    "def splitString(string, separator, debug=None):\n",
    "    if (debug==None):\n",
    "        debug = False\n",
    "    linElems = string.split(separator)\n",
    "    joinedElem = []\n",
    "    skip = False\n",
    "    countBracL = 0 # \"(\"\n",
    "    countBracR = 0 # \")\"\n",
    "    if (debug):\n",
    "        print(linElems,\"\\n\")\n",
    "    for e in linElems:\n",
    "        if ( \"(\" in e):\n",
    "            if countBracL == 0:\n",
    "                joinedElem.append(e)\n",
    "                countBracL += e.count(\"(\")\n",
    "                countBracR += e.count(\")\")\n",
    "                if (debug):\n",
    "                    print(\"(-elem =\",e)\n",
    "                    print(\"countBracL\", countBracL)\n",
    "                    print(\"countBracR\", countBracR)\n",
    "                if (countBracL != countBracR):\n",
    "                    skip = True\n",
    "                else:\n",
    "                    skip = False\n",
    "                    countBracR = 0\n",
    "                    countBracL = 0\n",
    "                    if (debug):\n",
    "                        print(\"skip:\",skip, \"\\n\", \"ResetCounter in 1:(\\n\")\n",
    "            else:   # not shure if this hole else-block is required anymore \n",
    "                joinedElem[-1] = separator.join([joinedElem[-1], e])\n",
    "                countBracL += e.count(\"(\")\n",
    "                countBracR += e.count(\")\")\n",
    "                if (debug):\n",
    "                    print(\"(-elem in 2=\",e)\n",
    "                    print(\"countBracL\", countBracL)\n",
    "                    print(\"countBracR\", countBracR)\n",
    "                    print(\"ELSE-BLOCK-REQUIRED\") # maybe find out in some test cases\n",
    "                if (countBracL != countBracR):\n",
    "                    skip = True\n",
    "                else:\n",
    "                    skip = False\n",
    "                    countBracR = 0\n",
    "                    countBracL = 0\n",
    "                    if (debug):\n",
    "                        print(\"skip:\",skip, \"\\n\", \"ResetCounter in 2:(\\n\")\n",
    "        elif (skip):\n",
    "            if (\")\" in e):\n",
    "                joinedElem[-1] = separator.join([joinedElem[-1], e])\n",
    "                countBracL += e.count(\"(\")\n",
    "                countBracR += e.count(\")\")\n",
    "                if (debug):\n",
    "                    print(\")-elem =\" ,e)\n",
    "                    print(\"countBracL\", countBracL)\n",
    "                    print(\"countBracR\", countBracR)\n",
    "                if (countBracL == countBracR):\n",
    "                    skip = False\n",
    "                    countBracR = 0\n",
    "                    countBracL = 0\n",
    "                    if (debug):\n",
    "                        print(\"skip:\",skip, \"\\n\", \"ResetCounter in 3:)\\n\")\n",
    "            else: \n",
    "                countBracL += e.count(\"(\")\n",
    "                countBracR += e.count(\")\")\n",
    "                if (debug):\n",
    "                    print(\"iterate update\", \"\\nlast elem:\",joinedElem[-1], \"\\nupd elem:\", e)\n",
    "                    print(\"countBracL\", countBracL)\n",
    "                    print(\"countBracR\", countBracR)\n",
    "                joinedElem[-1] = separator.join([joinedElem[-1], e])\n",
    "        elif not skip:\n",
    "            joinedElem.append(e)\n",
    "            if (debug):\n",
    "                print(\"no bracket element:\", e, \"\\n\")\n",
    "    if (debug):        \n",
    "        print(\"raw data\", string)\n",
    "        print(\"joinedElem\", joinedElem,\"\\n\")\n",
    "    return(joinedElem)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d03c1f25-901d-442e-9641-e341e0675b85",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Function definition: inverse normalization\n",
    "normUcumLinToFrac(ucum, debug=None)\n",
    "\n",
    "    debug \"True\" returns array, no debug returns string\n",
    "    brackets \"b\", negative exponent \"-\", fraction \"/\"\n",
    "    \n",
    "    b - /\n",
    "    X 0 0 -> #case1: no fraction, right format\n",
    "    X 0 1 -> #case2: fraction, right format\n",
    "    0 1 0 -> #case3: fraction normalize, positive and negative exponents allowed, without brackets\n",
    "    X 1 1 -> #case4: error, double fraction not allowed\n",
    "    1 1 0 -> #case5: fraction normalize, positive and negative exponents allowed, with brackets\n",
    "    \n",
    "    400 -> error, num of brackets invalid!\n",
    "    404 -> error, undefined!    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "f8fb09ff-0b94-4a56-8422-e9340651fe53",
   "metadata": {},
   "outputs": [],
   "source": [
    "def normUcumLinToFrac(ucum, debug=None):\n",
    "    linElems = []\n",
    "    numerator = []\n",
    "    denominator = []\n",
    "    bracketElems = []\n",
    "    fracElems = []\n",
    "    linBracElemLeft = \"\"\n",
    "    separator = \".\"\n",
    "    brackets = False\n",
    "\n",
    "    # define debug mode\n",
    "    if (debug==None) or not debug:\n",
    "        debug=False\n",
    "    else:\n",
    "        debug=True\n",
    "    \n",
    "    # normalize to only round brackets\n",
    "    ucum = ucum.replace(\"[\",\"(\").replace(\"]\",\")\").replace(\"{\",\"(\").replace(\"}\",\")\")\n",
    "    \n",
    "    #check valid input with/without brackets\n",
    "    if (ucum.count(\"(\")==ucum.count(\")\")):\n",
    "        if (\"(\" or \")\") in ucum:\n",
    "            #print(\"valid input with brackets:\")\n",
    "            brackets = True\n",
    "        else:\n",
    "            #print(\"valid input without brackets\")\n",
    "            brackets = False  \n",
    "    else:\n",
    "        if debug:\n",
    "            return([ucum, \"400\", \"error, num of brackets invalid!\"])\n",
    "        else:\n",
    "            return(\"400: error, num of brackets invalid!\")\n",
    "    #case1\n",
    "    if (\"-\" not in ucum) and (\"/\" not in ucum): \n",
    "        #print(\"000: no fraction, right format\")\n",
    "        if debug:\n",
    "            return([ucum, \"X00\", \"case1: no fraction, right format\"])\n",
    "        else:\n",
    "            return(ucum)\n",
    "    #case2\n",
    "    elif (\"-\" not in ucum) and (\"/\" in ucum): \n",
    "        #print(\"X01: fraction, right format\")\n",
    "        if ucum[0]==\"/\":\n",
    "            #print(\"first elem: /\")\n",
    "            result = \"1\"+ucum\n",
    "        else:\n",
    "            result = ucum\n",
    "        if debug:\n",
    "            return([result, \"X01\", \"case2: fraction, right format\"])\n",
    "        else:\n",
    "            return(result)\n",
    "    #case5, #case3\n",
    "    elif (\"-\" in ucum) and (\"/\" not in ucum): \n",
    "        #print(\"010: fraction normalize, positive and negative exponents allowed \")\n",
    "        #case 5 #valid input with brackets\n",
    "        if (brackets):\n",
    "            linElems = splitString(ucum, separator)\n",
    "            for e in linElems:\n",
    "                if \"-\" not in e:\n",
    "                    numerator.append(e)\n",
    "                else:\n",
    "                    denominator.append( (e[:e.find(\"-\")] + e[e.find(\"-\")+1:]) ) \n",
    "            result = \"/\".join([separator.join(numerator), separator.join(denominator)])\n",
    "            if debug:\n",
    "                return([result, \"110\", \"case5: fraction normalize, positive and negative exponents allowed, with brackets\"])\n",
    "            else:\n",
    "                return(result)\n",
    "                #return (''.join(char for char in result if char not in \"1\")) #filter \"1\" not ready yet\n",
    "        #case3 #valid input without brackets\n",
    "        else:    \n",
    "            linElems = ucum.split(separator)\n",
    "            for e in linElems:\n",
    "                if \"-\" not in e:\n",
    "                    e = ''.join(char for char in e if char not in \"1\") #filters \"1\", not factor sensitve yet, e.g. 100\n",
    "                    numerator.append(e)\n",
    "                else:\n",
    "                    e = ''.join(char for char in e if char not in \"1\") #filters \"1\", not factor sensitve yet, e.g. 100\n",
    "                    denominator.append( (e[:e.find(\"-\")] + e[e.find(\"-\")+1:]) )\n",
    "            if not numerator:\n",
    "                numerator.append(\"1\")\n",
    "            if len(denominator)>1:\n",
    "                result = \"/\".join([separator.join(numerator), \"(\"+separator.join(denominator)+\")\"])\n",
    "            else:\n",
    "                result = \"/\".join([separator.join(numerator), separator.join(denominator)])\n",
    "            if debug:\n",
    "                return([result, \"010\", \"case3: fraction normalize, positive and negative exponents allowed, without brackets\"])\n",
    "            else:\n",
    "                return (result)\n",
    "            #return (''.join(char for char in result if char not in \"1\")) #filter \"1\" not ready yet\n",
    "    #case4\n",
    "    elif (\"-\" in ucum) and (\"/\" in ucum): \n",
    "        if debug:\n",
    "            return([ucum, \"X11\", \"case4: error, double fraction not allowed\"])\n",
    "        else:\n",
    "            return(\"case4: error, double fraction not allowed\")\n",
    "    #undefined\n",
    "    else:\n",
    "        if debug:\n",
    "            return([ucum, \"404\", \"error, undefined!\"])\n",
    "        else:\n",
    "            return(\"error, undefined!\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7a7a062e-9439-4584-aac8-424c1a75d48f",
   "metadata": {
    "tags": []
   },
   "source": [
    "## 3. Validate inverse normalize\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "150e4465-703f-4a5f-8335-b7d1baf92e24",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Inverse Normalize: UCUM DATA"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fa34f493-3560-4404-aafb-274c78416c2c",
   "metadata": {
    "tags": []
   },
   "source": [
    "#### REGEX EXAMPLE: Filter single ones (positive exponents) + replace \"L\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "eba443d2-4cb3-45d0-a935-72c17a48bc91",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Match 1 was found at 10-11: 1\n",
      "Match 2 was found at 42-43: 1\n",
      "Match 3 was found at 52-53: 1\n",
      "Match 4 was found at 56-57: 1\n",
      "\n",
      "Replace single 1-digit in string \n",
      "pre:  [cft_i].s-1.11.23.231.123L45.5.12.2.4L.5.[1].s5.m2.l1.m-1.1/m \n",
      "past: [cft_i].s-REPlACEMENT.11.23.231.123l45.5.12.2.4l.5.[REPlACEMENT].s5.m2.lREPlACEMENT.m-REPlACEMENT.1/m\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "\n",
    "regex = r\"(?<!\\d)1(?!\\d|/)\" #for positive exponents\n",
    "#regex = r\"(?<!\\d|-)1(?!\\d|/)\" #for negative exponent case sensitivity of \"-\" detect\n",
    "\n",
    "test_str = \"[cft_i].s-1.11.23.231.123L45.5.12.2.4L.5.[1].s5.m2.l1.m-1.1/m\"\n",
    "\n",
    "matches = re.finditer(regex, test_str, re.MULTILINE)\n",
    "\n",
    "\n",
    "for matchNum, match in enumerate(matches, start=1):\n",
    "    \n",
    "    print (\"Match {matchNum} was found at {start}-{end}: {match}\".format(matchNum = matchNum, start = match.start(), end = match.end(), match = match.group()))\n",
    "    \n",
    "    for groupNum in range(0, len(match.groups())):\n",
    "        groupNum = groupNum + 1\n",
    "        \n",
    "        print (\"Group {groupNum} found at {start}-{end}: {group}\".format(groupNum = groupNum, start = match.start(groupNum), end = match.end(groupNum), group = match.group(groupNum)))\n",
    "        \n",
    "\n",
    "print(\"\\nReplace single 1-digit in string\", \"\\npre: \", test_str, \"\\npast:\", re.sub(regex, \"REPLACEMENT\", test_str).replace(\"L\",\"l\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cf19781a-da33-4fe3-af36-1fbdc4f8f099",
   "metadata": {},
   "source": [
    "#### Valitation with regex"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "d1ea1b15-c0dc-4647-8dd1-7e98f10851d6",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "erg/(cm2.s) <-> erg/(s.cm2) is just unsorted\n",
      "Error: brackets without fraktion in (breaths)/min\n",
      "1/(s.m2.sr) <-> 1/(m2.s.sr) is just unsorted\n",
      "kg/(s.m2) <-> kg/(m2.s) is just unsorted\n",
      "m.K/W <-> K.m/W is just unsorted\n",
      "Error: brackets without fraktion in (lb_av)/(cft_i)\n",
      "Error: brackets without fraktion in (lb_av)/(ft_i)3\n",
      "Error: brackets without fraktion in (lb_av)/(cyd_i)\n",
      "Error: brackets without fraktion in (lb_av)/(yd_i)3\n",
      "Error: brackets without fraktion in (sft_i)/s\n",
      "Error: brackets without fraktion in (ft_i)2/s\n",
      "Error: brackets without fraktion in (sin_i)/s\n",
      "Error: brackets without fraktion in (in_i)2/s\n",
      "Error: brackets without fraktion in (sft_i)/h\n",
      "Error: brackets without fraktion in (ft_i)2/h\n",
      "Error: brackets without fraktion in (mi_us)2\n",
      "Error: brackets without fraktion in (smi_us)\n",
      "Error: brackets without fraktion in (yd_i)2\n",
      "Error: brackets without fraktion in (syd_i)\n",
      "Error: brackets without fraktion in (ft_i)3\n",
      "Error: brackets without fraktion in (cft_i)\n",
      "Error: brackets without fraktion in (tsp_us)\n",
      "Error: brackets without fraktion in (tsp_m)\n",
      "Error: brackets without fraktion in (Btu_th)\n",
      "Error: brackets without fraktion in (Btu)\n",
      "Error: brackets without fraktion in (lbf_av)/(sin_i)\n",
      "Error: brackets without fraktion in (psi)\n",
      "Error: brackets without fraktion in (rd_br)\n",
      "Error: brackets without fraktion in (rd_us)\n",
      "Error: brackets without fraktion in (ft_i)3/min\n",
      "Error: brackets without fraktion in (cft_i)/min\n",
      "Error: brackets without fraktion in (in_i)3\n",
      "Error: brackets without fraktion in (cin_i)\n",
      "242\n",
      "345\n",
      "28\n",
      "just unsorted counter:  4\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "regex = r\"(?<!\\d)1(?!\\d|/)\" #for positive exponents\n",
    "\n",
    "diff_ucum_wucum_inv = {}\n",
    "diff_ucum_wucumNorm_inv = {}\n",
    "diff_ucumNorm_wucumNorm_inv = {}\n",
    "diffCasefold_ucumNorm_wucumNorm = {}\n",
    "unsorted_inv = {}\n",
    "counter = 0\n",
    "for wu in wudict:\n",
    "    if 'http://www.wikidata.org/prop/direct/P2968' in wudict[wu] and 'http://www.wikidata.org/prop/direct/P7825' in wudict[wu]: #qudt and ucum defined \n",
    "        u = wudict[wu]['http://www.wikidata.org/prop/direct-normalized/P2968'][0] #qudt unit\n",
    "        w_ucum = wudict[wu]['http://www.wikidata.org/prop/direct/P7825'][0] # wikidate ucum\n",
    "        \n",
    "        w_ucum_norm = re.sub(regex, \"\", normUcumLinToFrac(wudict[wu]['http://www.wikidata.org/prop/direct/P7825'][0])).replace(\"L\",\"l\") # wikidate ucum normalized\n",
    "        if u in udict and 'http://qudt.org/schema/qudt/ucumCode' in udict[u]: #ucum defined \n",
    "            e = udict[u]['http://qudt.org/schema/qudt/ucumCode'][0]\n",
    "            ucum_norm = re.sub(regex, \"\", normUcumLinToFrac(e)).replace(\"L\",\"l\")  # ucum defined & normalized\n",
    "            if e != w_ucum:\n",
    "                diff_ucum_wucum_inv[u] = f\"{e} <-> {w_ucum} DIFF FOR {u} <-> {wu}\"\n",
    "            if e != w_ucum_norm:\n",
    "                diff_ucum_wucumNorm_inv[u] = f\"{e} <-> {w_ucum_norm} DIFF FOR {u} <-> NORM {wu}\"\n",
    "            if ucum_norm != w_ucum_norm:\n",
    "                if compareUnitElements(normUcumFracToLin(ucum_norm), normUcumFracToLin(w_ucum_norm), \".\"):\n",
    "                #if compareUnitElements(ucum_norm, w_ucum_norm, \".\"):\n",
    "                    print(f\"{ucum_norm} <-> {w_ucum_norm} is just unsorted\")\n",
    "                    counter+=1\n",
    "                    #diff_ucumNorm_wucumNorm_inv[u] = f\"{ucum_norm} <-> {w_ucum_norm} DIFF FOR NORM {u} <-> NORM {wu}\"\n",
    "                    unsorted_inv[u] = f\"{ucum_norm} <-> {w_ucum_norm} DIFF FOR NORM {u} <-> NORM {wu}\"\n",
    "                else:\n",
    "                    diff_ucumNorm_wucumNorm_inv[u] = f\"{ucum_norm} <-> {w_ucum_norm} DIFF FOR NORM {u} <-> NORM {wu}\"\n",
    "                    dataCleaningDict[\"frac\"][ucum_norm] = w_ucum_norm\n",
    "\n",
    "\n",
    "                \n",
    "dictToJson(diff_ucum_wucum_inv, '10diff_ucum_wucum_inv', 'index')\n",
    "print(len(diff_ucum_wucum_inv))\n",
    "dictToJson(diff_ucum_wucumNorm_inv, '20diff_ucum_wucumNorm_inv', 'index')\n",
    "print(len(diff_ucum_wucumNorm_inv))\n",
    "dictToJson(diff_ucumNorm_wucumNorm_inv, '30diff_ucumNorm_wucumNorm_inv', 'index')\n",
    "print(len(diff_ucumNorm_wucumNorm_inv))\n",
    "print(\"just unsorted counter: \", counter)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "734422f5-363e-46e9-9f1a-6c6f2bdd2554",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "diff_ucumNorm_wucumNorm_inv LENGTH 28\n",
      "diff_ucumNorm_wucumNorm LENGHT:  34\n",
      "\n",
      "NOT IN NORM_INV\n",
      "http://qudt.org/vocab/unit/FT3-PER-SEC (cft_i).s-1 <-> (cft_i)/s DIFF FOR NORM http://qudt.org/vocab/unit/FT3-PER-SEC <-> NORM http://www.wikidata.org/entity/Q5196162\n",
      "http://qudt.org/vocab/unit/KiloGM-PER-SEC-M2 kg.(s.m2)-1 <-> kg.m-2.s-1 DIFF FOR NORM http://qudt.org/vocab/unit/KiloGM-PER-SEC-M2 <-> NORM http://www.wikidata.org/entity/Q92011107\n",
      "http://qudt.org/vocab/unit/M3-PER-KiloGM-SEC2 m3.(kg.s2)-1 <-> m3.kg-1.s-2 DIFF FOR NORM http://qudt.org/vocab/unit/M3-PER-KiloGM-SEC2 <-> NORM http://www.wikidata.org/entity/Q78336909\n",
      "http://qudt.org/vocab/unit/FT-PER-HR (ft_i).h-1 <-> (ft_i)/h DIFF FOR NORM http://qudt.org/vocab/unit/FT-PER-HR <-> NORM http://www.wikidata.org/entity/Q106611504\n",
      "http://qudt.org/vocab/unit/MI-PER-MIN (mi_i).min-1 <-> (mi_i)/min DIFF FOR NORM http://qudt.org/vocab/unit/MI-PER-MIN <-> NORM http://www.wikidata.org/entity/Q106611642\n",
      "http://qudt.org/vocab/unit/LB-PER-IN3 (lb_av).(cin_i)-1 <-> (lb_av)/(cin_i) DIFF FOR NORM http://qudt.org/vocab/unit/LB-PER-IN3 <-> NORM http://www.wikidata.org/entity/Q106623879\n",
      "both_counter =  28\n",
      "not in both coutner=  6\n",
      "\n",
      "NOT IN NORM\n",
      "both_counter =  28\n",
      "not in both coutner=  0\n"
     ]
    }
   ],
   "source": [
    "# check differences of FracToLin and LinToFrac normalizations\n",
    "diff_normFunctions = {}\n",
    "both_counter = 0\n",
    "\n",
    "print(\"diff_ucumNorm_wucumNorm_inv LENGTH\",len(diff_ucumNorm_wucumNorm_inv))\n",
    "print(\"diff_ucumNorm_wucumNorm LENGHT: \" ,len(diff_ucumNorm_wucumNorm))\n",
    "\n",
    "print(\"\\nNOT IN NORM_INV\")\n",
    "for k,v  in diff_ucumNorm_wucumNorm.items():\n",
    "    if k in diff_ucumNorm_wucumNorm_inv.keys():\n",
    "        #print(k, v)\n",
    "        both_counter += 1\n",
    "    else:\n",
    "        diff_normFunctions[k] = v\n",
    "        print(k, v)\n",
    "        \n",
    "print(\"both_counter = \", both_counter)\n",
    "print(\"not in both coutner= \", len(diff_normFunctions))\n",
    "\n",
    "diff_normFunctions = {}\n",
    "both_counter = 0\n",
    "print(\"\\nNOT IN NORM\")\n",
    "for k,v  in diff_ucumNorm_wucumNorm_inv.items():\n",
    "    if k in diff_ucumNorm_wucumNorm.keys():\n",
    "        #print(k, v)\n",
    "        both_counter += 1\n",
    "    else:\n",
    "        diff_normFunctions[k] = v\n",
    "        print(k, v)\n",
    "        \n",
    "print(\"both_counter = \", both_counter)\n",
    "print(\"not in both coutner= \", len(diff_normFunctions))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "e6a789cf-db89-4699-97c9-8ec2d2dc5429",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4\n",
      "3\n",
      "just unsorted_inv\n",
      "http://qudt.org/vocab/unit/ERG-PER-CentiM2-SEC erg/(cm2.s) <-> erg/(s.cm2) DIFF FOR NORM http://qudt.org/vocab/unit/ERG-PER-CentiM2-SEC <-> NORM http://www.wikidata.org/entity/Q28657331\n",
      "http://qudt.org/vocab/unit/PER-SEC-M2-SR 1/(s.m2.sr) <-> 1/(m2.s.sr) DIFF FOR NORM http://qudt.org/vocab/unit/PER-SEC-M2-SR <-> NORM http://www.wikidata.org/entity/Q83855084\n",
      "http://qudt.org/vocab/unit/KiloGM-PER-SEC-M2 kg/(s.m2) <-> kg/(m2.s) DIFF FOR NORM http://qudt.org/vocab/unit/KiloGM-PER-SEC-M2 <-> NORM http://www.wikidata.org/entity/Q92011107\n",
      "http://qudt.org/vocab/unit/M-K-PER-W m.K/W <-> K.m/W DIFF FOR NORM http://qudt.org/vocab/unit/M-K-PER-W <-> NORM http://www.wikidata.org/entity/Q84451486\n",
      "just unsorted\n",
      "http://qudt.org/vocab/unit/ERG-PER-CentiM2-SEC erg.cm-2.s-1 <-> erg.s-1.cm-2 DIFF FOR NORM http://qudt.org/vocab/unit/ERG-PER-CentiM2-SEC <-> NORM http://www.wikidata.org/entity/Q28657331\n",
      "http://qudt.org/vocab/unit/PER-SEC-M2-SR s-1.m-2.sr-1 <-> m-2.s-1.sr-1 DIFF FOR NORM http://qudt.org/vocab/unit/PER-SEC-M2-SR <-> NORM http://www.wikidata.org/entity/Q83855084\n",
      "http://qudt.org/vocab/unit/M-K-PER-W m.K.W-1 <-> K.m.W-1 DIFF FOR NORM http://qudt.org/vocab/unit/M-K-PER-W <-> NORM http://www.wikidata.org/entity/Q84451486\n"
     ]
    }
   ],
   "source": [
    "print(len(unsorted_inv))\n",
    "print(len(unsorted))\n",
    "\n",
    "print(\"just unsorted_inv\")\n",
    "for k,v in unsorted_inv.items():\n",
    "    print(k,v)\n",
    "    \n",
    "print(\"just unsorted\")\n",
    "for k,v in unsorted.items():\n",
    "    print(k,v)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "8cd47fb3-30d9-4c26-9030-a46f1afe73c4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'exp': {'(Btu_th)': '(Btu)',\n",
      "         '(cft_i).s-1': '(cft_i)/s',\n",
      "         '(ft_i).h-1': '(ft_i)/h',\n",
      "         '(ft_i)3': '(cft_i)',\n",
      "         '(ft_i)3/min': '(cft_i)/min',\n",
      "         '(in_i)3': '(cin_i)',\n",
      "         '(lb_av).(cft_i)-1': '(lb_av)/(ft_i)3',\n",
      "         '(lb_av).(cin_i)-1': '(lb_av)/(cin_i)',\n",
      "         '(lb_av).(cyd_i)-1': '(lb_av)/(yd_i)3',\n",
      "         '(lbf_av).(sin_i)-1': '(psi)',\n",
      "         '(mi_i).min-1': '(mi_i)/min',\n",
      "         '(mi_us)2': '(smi_us)',\n",
      "         '(rd_br)': '(rd_us)',\n",
      "         '(sft_i).h-1': '(ft_i)2/h',\n",
      "         '(sft_i).s-1': '(ft_i)2/s',\n",
      "         '(sin_i).s-1': '(in_i)2/s',\n",
      "         '(tsp_us)': '(tsp_m)',\n",
      "         '(yd_i)2': '(syd_i)',\n",
      "         'A.m-2.K-1': 'A.m-2.K-2',\n",
      "         'Bd': 'bit.s-1',\n",
      "         'GP': 'GPa',\n",
      "         'N.m.kg-2': 'N.m2.kg-2',\n",
      "         'N.m.s-1': 'N.m.s',\n",
      "         'P.s.m-1': 'Pa.s.m-1',\n",
      "         'S.cm-2': 'S.cm-1',\n",
      "         'TW.h-1': 'TW.h',\n",
      "         'eV.s-1': 'eV.s',\n",
      "         'kbit.s-2': 'kbit.s-1',\n",
      "         'kcal': 'kcal_th',\n",
      "         'kg.(s.m2)-1': 'kg.m-2.s-1',\n",
      "         'lm.s-1': 'lm.s',\n",
      "         'm3.(kg.s2)-1': 'm3.kg-1.s-2',\n",
      "         'minbreath-1': '(breaths)/min',\n",
      "         'rad.m-2.mol-1': 'rad.m2.mol-1'},\n",
      " 'frac': {'(Btu_th)': '(Btu)',\n",
      "          '(ft_i)3': '(cft_i)',\n",
      "          '(ft_i)3/min': '(cft_i)/min',\n",
      "          '(in_i)3': '(cin_i)',\n",
      "          '(lb_av)/(cft_i)': '(lb_av)/(ft_i)3',\n",
      "          '(lb_av)/(cyd_i)': '(lb_av)/(yd_i)3',\n",
      "          '(lbf_av)/(sin_i)': '(psi)',\n",
      "          '(mi_us)2': '(smi_us)',\n",
      "          '(rd_br)': '(rd_us)',\n",
      "          '(sft_i)/h': '(ft_i)2/h',\n",
      "          '(sft_i)/s': '(ft_i)2/s',\n",
      "          '(sin_i)/s': '(in_i)2/s',\n",
      "          '(tsp_us)': '(tsp_m)',\n",
      "          '(yd_i)2': '(syd_i)',\n",
      "          '1/min(breath)': '(breaths)/min',\n",
      "          'A/(m2.K)': 'A/(m2.K2)',\n",
      "          'Bd': 'bit/s',\n",
      "          'GP': 'GPa',\n",
      "          'N.m/kg2': 'N.m2/kg2',\n",
      "          'N.m/s': 'N.m.s',\n",
      "          'P.s/m': 'Pa.s/m',\n",
      "          'S/cm2': 'S/cm',\n",
      "          'TW/h': 'TW.h',\n",
      "          'eV/s': 'eV.s',\n",
      "          'kbit/s2': 'kbit/s',\n",
      "          'kcal': 'kcal_th',\n",
      "          'lm/s': 'lm.s',\n",
      "          'rad/(m2.mol)': 'rad.m2/mol'}}\n"
     ]
    }
   ],
   "source": [
    "# show cleaning dict, this has to be sorted manually afterwards\n",
    "import pprint\n",
    "pprint.pprint(dataCleaningDict)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "886de064-1f00-4b12-ad42-d72ad447388c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# copy & paste cleaining dict and bring key-value-pairs in right order\n",
    "# key is NOT allowed ucum, value is allowed ucum\n",
    "\n",
    "dataCleaningDict = {\n",
    "    'exp': {\n",
    "         '(Btu_th)': '(Btu)',\n",
    "         '(cft_i).s-1': '(ft_i)3.s-1',\n",
    "         '(cft_i)/s': '(ft_i)3.s-1',\n",
    "         '(ft_i)/h': '(ft_i).h-1',\n",
    "         '(cft_i)': '(ft_i)3',\n",
    "         '(cft_i)/min': '(ft_i)3.min-1',\n",
    "         '(ft_i)3/min': '(ft_i)3.min-1',\n",
    "         '(cin_i)': '(in_i)3',\n",
    "         '(lb_av).(cft_i)-1': '(lb_av)/(ft_i)3',\n",
    "         '(lb_av).(cin_i)-1': '(lb_av).(in_i)-3',\n",
    "         '(lb_av)/(cin_i)': '(lb_av).(in_i)-3',\n",
    "         '(lb_av).(cyd_i)-1': '(lb_av)/(yd_i)3',\n",
    "         '(lbf_av).(sin_i)-1': '(psi)',\n",
    "         '(mi_i)/min': '(mi_i).min-1',\n",
    "         '(smi_us)': '(mi_us)2',\n",
    "         '(sft_i).h-1': '(ft_i)2.h-1',\n",
    "         '(ft_i)2/h': '(ft_i)2.h-1',\n",
    "         '(sft_i).s-1': '(ft_i)2.s-1',\n",
    "         '(ft_i)2/s': '(ft_i)2.s-1',\n",
    "         '(sin_i).s-1': '(in_i)2.s-1',\n",
    "         '(in_i)2/s': '(in_i)2.s-1',\n",
    "         '(syd_i)': '(yd_i)2',\n",
    "         'A.m-2.K-1': 'A.m-2.K-2',\n",
    "         'Bd': 'bit.s-1',\n",
    "         'C.m-3': 'C.cm-3',\n",
    "         'GP': 'GPa',\n",
    "         'N.m.kg-2': 'N.m2.kg-2',\n",
    "         'N.m.s-1': 'N.m.s',\n",
    "         'P.s.m-1': 'Pa.s.m-1',\n",
    "         'S.cm-2': 'S.cm-1',\n",
    "         'TW.h-1': 'TW.h',\n",
    "         'eV.s-1': 'eV.s',\n",
    "         'kbit.s-2': 'kbit.s-1',\n",
    "         'kcal_th': 'kcal',\n",
    "         'kg.(s.m2)-1': 'kg.m-2.s-1',\n",
    "         'kg.mol-1': 'kg.kmol-1',\n",
    "         'lm.s-1': 'lm.s',\n",
    "         'm\"': \"m''\",\n",
    "         'm3.(kg.s2)-1': 'm3.kg-1.s-2',\n",
    "         'minbreath-1': '(breaths).min-1',\n",
    "         '(breaths)/min': '(breaths).min-1',\n",
    "         'rad.m-2.mol-1': 'rad.m2.mol-1'\n",
    "     },\n",
    "     'frac': {\n",
    "          '(Btu_th)': '(Btu)',\n",
    "          '(cft_i)': '(ft_i)3',\n",
    "          '(cft_i)/min': '(ft_i)3/min',\n",
    "          '(cin_i)': '(in_i)3',\n",
    "          '(lb_av)/(cft_i)': '(lb_av)/(ft_i)3',\n",
    "          '(lb_av)/(cyd_i)': '(lb_av)/(yd_i)3',\n",
    "          '(lbf_av)/(sin_i)': '(psi)',\n",
    "          '(smi_us)': '(mi_us)2',\n",
    "          '(sft_i)/h': '(ft_i)2/h',\n",
    "          '(sft_i)/s': '(ft_i)2/s',\n",
    "          '(sin_i)/s': '(in_i)2/s',\n",
    "          '(syd_i)': '(yd_i)2',\n",
    "          '1/min(breath)': '(breaths)/min',\n",
    "          'A/(m2.K)': 'A/(m2.K2)',\n",
    "          'Bd': 'bit/s',\n",
    "          'C/m3': 'C/cm3',\n",
    "          'GP': 'GPa',\n",
    "          'N.m/kg2': 'N.m2/kg2',\n",
    "          'N.m/s': 'N.m.s',\n",
    "          'P.s/m': 'Pa.s/m',\n",
    "          'S/cm2': 'S/cm',\n",
    "          'TW/h': 'TW.h',\n",
    "          'eV/s': 'eV.s',\n",
    "          'kbit/s2': 'kbit/s',\n",
    "          'kcal_th': 'kcal',\n",
    "          'kg/mol': 'kg/kmol',\n",
    "          'lm/s': 'lm.s',\n",
    "          'm\"': \"m''\",\n",
    "          'rad/(m2.mol)': 'rad.m2/mol'\n",
    "      }\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b4ce8730-3ae0-4aec-aa4c-c2cef9c93655",
   "metadata": {},
   "source": [
    "## 4. Ucum-Mapping-Dictionary\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3d894193-8a4c-4855-b9dd-3c3482e48079",
   "metadata": {},
   "source": [
    "### Define regex wrapper\n",
    "\n",
    "- eliminate \"1\"-factors\n",
    "- change \"L\" uppercase to \"l\" lowercase"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "09da0a0b-6529-4a94-b831-310d23806b62",
   "metadata": {
    "tags": []
   },
   "source": [
    "#### normUcumFracToLin() + regex + \"L\" to lowercase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "af880400-b1e1-484a-b6de-dc41b25ab74a",
   "metadata": {},
   "outputs": [],
   "source": [
    "def normRegUcumFTL(ucum):\n",
    "    import re\n",
    "    regex = r\"(?<!\\d|-)1(?!\\d|/)\" # for positive exponents\n",
    "    return (re.sub(regex, \"\", normUcumFracToLin(ucum)).replace(\"L\",\"l\") )  # ucum defined & normalized\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "231da302-cafa-41db-9a6e-ac30782b4bd4",
   "metadata": {
    "tags": []
   },
   "source": [
    "##### test wrapper FTL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "f3c359de-7b96-47b0-9dd9-6d2f4bb35b05",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.m-1\n",
      ".m-1\n"
     ]
    }
   ],
   "source": [
    "FTL = \"1/m\"\n",
    "\n",
    "print(normUcumFracToLin(FTL))\n",
    "print(normRegUcumFTL(FTL))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "17118d1b-ec84-4f1e-b8dd-53d4492799fa",
   "metadata": {},
   "source": [
    "#### normUcumLinToFrac() + regex + \"L\" to lowercase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "910ae306-2e02-4d58-b874-04b2a16ad6e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "def normRegUcumLTF(ucum):\n",
    "    if \"1\" or \"L\" in ucum:\n",
    "        import re\n",
    "        #regex = r\"(?<!\\d)1(?!\\d|/)\" \n",
    "        regex = r\"(?<!\\d)1(?!\\d)\" \n",
    "        return (re.sub(regex, \"\", normUcumLinToFrac(ucum)).replace(\"L\",\"l\") )  # ucum defined & normalized\n",
    "    else:\n",
    "        return (ucum)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "9ae5339a-12e2-4a1e-80eb-208362dd782f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def normRegUcumLTF(ucum):\n",
    "    if \"1\" or \"L\" in ucum:\n",
    "        import re\n",
    "        regex = r\"(?<!\\d)1(?!\\d)\" # filter all ones without digit neigbours\n",
    "        ucum = re.sub(regex, \"\", normUcumLinToFrac(ucum)).replace(\"L\",\"l\")\n",
    "        if ucum[0] == \"/\":\n",
    "            ucum = \"1\" + ucum\n",
    "        return (ucum)  # ucum defined & normalized\n",
    "    else:\n",
    "        return (ucum)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1e189b33-6879-4733-8d6d-f489cb101602",
   "metadata": {},
   "source": [
    "##### test wrapper LTF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "287750b2-1712-4443-8d83-869bf2e47d40",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "normLTF:  (kg.m)1/s1\n",
      "LTF+REG:  (kg.m)/s \n",
      "\n",
      "normLTF:  /(kg.m)1.s1\n",
      "LTF+REG:  1/(kg.m).s \n",
      "\n",
      "normLTF:  /(kg.m)2.s1\n",
      "LTF+REG:  1/(kg.m)2.s \n",
      "\n",
      "normLTF:  1/kg\n",
      "LTF+REG:  1/kg \n",
      "\n",
      "normLTF:  case4: error, double fraction not allowed\n",
      "LTF+REG:  case4: error, double fraction not allowed \n",
      "\n",
      "normLTF:  1/L\n",
      "LTF+REG:  1/l \n",
      "\n",
      "normLTF:  1/L\n",
      "LTF+REG:  1/l \n",
      "\n"
     ]
    }
   ],
   "source": [
    "testarray = [\"(kg.m)1.s-1\",\"(kg.m)-1.s-1\",\"(kg.m)-2.s-1\",\"kg-1\", \"[cft_i].s-1.11.23.231.123L45.5.12.2.4L.5.[1].s5.m2.l1.m-1.1/m.1.1/sdf\", \"1/L\", \"L-1\"]\n",
    "\n",
    "for LTF in testarray:\n",
    "    print(\"normLTF: \",normUcumLinToFrac(LTF))\n",
    "    print(\"LTF+REG: \",normRegUcumLTF(LTF),\"\\n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c7cf695e-69e8-477e-b89a-8a7a99012952",
   "metadata": {},
   "source": [
    "### Create mapping dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9036f03a-c9d5-4cf1-8752-2f7168a25dff",
   "metadata": {},
   "outputs": [],
   "source": [
    "# ucum mapping dictionary\n",
    "ucumMappingDict = {\n",
    "    \n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a4a9d2d0-5894-460f-b6e1-2f5cba47326f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
